import { UtilsService } from 'services/utils.service';
import { Injectable } from '@angular/core';
import { EN_Routes } from 'interfaces/routes.enum';

import { AddNewComponent } from '../frame-work/manage/add-new/add-new.component';

export interface IHelpWrapper {
  title: string,
  messageOne: string,
  messageTwo?: string,
  messageThree?: string,
  imgOne?: string,
  imgTwo?: string,
}
@Injectable({
  providedIn: 'root'
})
export class HelpWrapperService {
  private messageToShow: IHelpWrapper = {
    title: '',
    imgOne: '',
    imgTwo: '',
    messageOne: '',
    messageTwo: '',
    messageThree: '',
  }

  constructor(
    private utilsService: UtilsService
  ) { }

  /* STATIC ROUTE S*/
  private exactRoute = (currentRoute: string): IHelpWrapper => {
    if (currentRoute === EN_Routes.wr)
      return {
        title: 'مشاهده نقشه',
        messageOne: '1-	امکان استفاده از دو لایه ظاهری2-	پرینت نقشه بصورت عمودی و افقی3-	بزرگ و کوچک کردن نقشه4-	بارگذاری مجدد نقشه درصورت خطا در نمایش احتمالی5-	مکان یابی6-	حذف تمامی لایه ها',
        imgOne: 'assets/imgs/help/wr1.jpg',
        messageTwo: 'بعد از ورود، در سمت راست صفحه نوار کنار قابل مشاهده است که بستگی به سطح دسترسی تعیین شده و نیاز شما، گزینش شده است. نام قابل نمایش شما در بالا سمت راست و تاریخ، انتخاب رنگ پیش زمینه، گزینه های تنظیمات کاربری، مجوز، گفتگو و خروج در بالا سمت چپ قابل مشاهده می باشد. جهت اطلاع از آخرین اطلاعیه های گروهی و شخصی، سامانه لحظه باید در وضعیت متصل قرار داشته باشد. درصورت عدم اتصال، سیستم بطور خودکار تا اتصال مجدد تلاش خواهد نمود مگر آنکه عوامل دیگر( عدم دسترسی شبکه- عدم دسترسی به اینترنت- قطع سرویس دهنده و ...) اتفاق افتاده باشند.',
        messageThree: 'برای تغییر رنگ پیش زمینه کافی است برروی آخرین آیکن کلیک کرده تا رنگ دلخواه را مطابق سلیقه خودتان بتوانید انتخاب نمایید. برای مشاهده تاریخ انقضا و نوع طرح به مجوز مراجعه نمایید.سه نوع طرح طلایی، نقره ای، و برنزی وجود دارد که سطح دسترسی و امکانات قابل استفاده از برنامه را متمایز می کند. قبل از اتمام زمان طرح خریداری شده، سیستم بطور خودکار هشداری مبنی بر لزوم تمدید طرح را اعلام می دارد. '
      }
    if (currentRoute === EN_Routes.wrdb)
      return {
        title: 'داشبورد',
        messageOne: 'گزارش های جامع(قرائت های انجام شده - تصاویر ارسالی- موارد غیرمجاز ثبت شده - گزارشات ثبت شده و ..)',
        messageThree: 'عملکرد فرایند قرائت، در دو نمودار رادار و میله‌ای قابل مشاهده و بررسی هستند.',
        messageTwo: 'قسمت کارکرد، مربوط به اطلاعات قرائت به تفکیک روز، هفته، ماه و سال میباشد. ',
      }
    else if (currentRoute === EN_Routes.wrmuall)
      return {
        title: 'مشاهده کاربران',
        messageOne: 'بخش مشاهده کاربران، اطلاعات کلی و ویرایش کاربران در دسترس می باشد. سه آیکن سمت چپ مربوط به ویرایش اطلاعات کاربر، جزئیات ورود های قبلی و تنظیمات بیشتر کاربر می باشد. تنظیمات بیشتر برای فعال سازی، غیرفعال سازی، بازنشانی رمز عبور و unlock کردن کاربر  می باشد.',
        imgOne: 'assets/imgs/help/edit/edit.JPG',
        messageTwo: '✔️	بازنشانی بمعنای تغییر رمز عبور به شماره موبایل کابر است. \n ✔️	 قفل به معنای دسترسی یا عدم دسترسی کاربر به برنامه می باشد. در صورت اشتباه متوالی شش(6) دفعه در وارد کردن رمزعبور، کاربر به مدت 30 دقیقه قفل خواهد شد. و با هر بار اشتباه مجدد بعد از آن، زمان قفل شدن افزایش می‌یابد. \n ✔️	فعال یا غیر فعال بودن به معنای دسترسی کاربر به برنامه است و مدت مشخصی ندارد. \n ✔️	اطلاعات هر کاربری قابل ویرایش است. \n ✔️	قسمت افزودن کاربر جدید برای معرفی کاربر جدید می باشد. با کامل کردن زیر قسمت های مربوطه(مشخصات کاربر-دسترسی به ناحیه-دسترسی به خدمات ارائه شده در برنامه - نوع یا گروه دسترسی) نسبت به ایجاد کاربر اقدام نمایید. ',
      }
    else if (currentRoute === EN_Routes.wrmuedit)
      return {
        title: 'ویرایش کاربر',
        messageOne: 'این قسمت به ویرایش اطلاعات شخصی کاربر مانند نام کاربری یا کد کاربری، نواحی قابل دسترسی کاربر، سطح دسترسی ها و نقش کاربر تقسیم می شود. دسترسی به خدمات کاربر در این قسمت مشخص می شود. زیر بخش نواحی برای دسترسی به ناحیهِ مدنظر کاربر درنظر گرفته شده است.',
        imgOne: 'assets/imgs/help/edit/edit1.JPG',
        messageTwo: 'زیر بخش سطح دسترسی به خدمات شامل اپلیکیشن قرائت ، مدیریت سامانه و سامانه قرائت کنتور است که محدود کننده سطح دسترسی کاربر است. گروه دسترسی جهت تعیین دسترسی ها و سمت ها کاربرد دارد. ',
        imgTwo: 'assets/imgs/help/edit/edit2.JPG',
        messageThree: '\n ✔️	عدم مشاهده ستونهای کارتابل جهت جلوگیری از هرگونه اشتباه برای عدم نمایش برخی از ستون ها در کارتابل درنظر گرفته شده است. \n ✔️	جهت پویایی برنامه نقش های قابل تعیین در قسمت مدیریت گروه مشخص می شوند. '
      }

    else if (currentRoute === EN_Routes.wrmuadd)
      return {
        title: 'افزودن کاربر',
        messageOne: 'برای افزودن کاربر جدید لازم است مشخصات کاربر، دسترسی به مناطق، دسترسی به خدمات و انتخاب گروه دسترسی کامل شوند.',
        imgOne: 'assets/imgs/help/add/add.JPG',
        messageTwo: 'لازم بذکر است که هر کاربر بطور کاملا پویا میتواند دسترسی های متفاوتی برحسب وظیفه و کار ایشان داشته باشد',
        messageThree: 'لازم بذکر است که هر کاربر بطور کاملا پویا می تواند دسترسی های متفاوتی برحسب وظیفه و کار ایشان داشته باشد. \n ✔️	عدم مشاهده ستونهای کارتابل جهت جلوگیری از هرگونه اشتباه برای عدم نمایش برخی از ستون ها در کارتابل درنظر گرفته شده است.  \n ✔️	جهت پویایی برنامه نقش های قابل تعیین در قسمت مدیریت گروه مشخص می شوند. \n ✔️	نام نمایش جهت نمایش نام کاربر در برنامه استفاده می شود. '
      }
    else if (currentRoute === EN_Routes.wrmurole)
      return {
        title: 'مدیریت گروه ها',
        messageOne: 'این بخش جهت ایجاد و بررسی نقش/گروه های موجود ایجاد شده است.',
      }
    else if (currentRoute === EN_Routes.wrmueor)
      return {
        title: 'ویرایش گروهی کاربران',
        messageOne: 'جهت تغییر گروهی سطح دسترسی کاربران استفاده میشود.',
        messageTwo: 'توجه فرمایید دسترسی کاربران در گروه دقیقا منطبق با دسترسی تعیین شده توسط شما خواهد بود (تغییرات در دسترسی های قبلی لحاظ نمیگردد بلکه دسترسی های اعطا شده پس از ذخیره توسط شما اعمال خواهد شد). \n ✔️	کلیه کاربران در گروه مد نظر شما تا زمان ورود مجدد به سامانه اجازه فعالیت نخواهند داشت. \n ✔️	نام نمایش جهت نمایش نام کاربر در برنامه استفاده می شود. '
      }
    else if (currentRoute === EN_Routes.wrmusearch) {
      return {
        title: 'جستجوی کاربران',
        messageOne: 'جهت جستجوی کاربران با هر سطح دسترسی، گروه دسترسی یا دسترسی به ناحیه ای ارائه شده است. کافی است پس از انتخاب مقادیر دلخواه به قسمت نمایش رفته و برروی نمایش کاربران کلیک نمایید. برای مثال در گروه دسترسی ناظر ستادی انتخاب و سپس در صفحه نمایش برروی نمایش کاربران کلیک نمایید.'
      }
    }
    else if (currentRoute === EN_Routes.userOnlines) {
      return {
        title: 'کاربران آنلاین',
        messageOne: 'مشاهده کاربرانی که درحال حاضر به سامانه متصل هستند. امکان ارسال پیام شخصی، پیام تصویری و پیام ویدیویی به هر کاربر وجود دارد. \n ✔️	زمان، آخرین فعالیت کاربر است '
      }
    }
    else if (currentRoute === EN_Routes.region || currentRoute === EN_Routes.wrmzsp || currentRoute === EN_Routes.zoneBound || currentRoute === EN_Routes.zone || currentRoute === EN_Routes.wrmzsc)
      return {
        title: 'مدیریت نواحی',
        messageOne: 'این بخش برای مشاهده، شخصی سازی و کنترل نواحی درنظر گرفته شده است. هر محدوده زیرمجموعه یک ناحیه/شهر و هر ناحیه/شهر زیرمجموعه یک منطقه و هر منطقه زیرمجموعه یک استان است.',
        imgOne: 'assets/imgs/help/ARE.PNG',
        messageTwo: 'برای افزودن یک ناحیه، پس از کلیک برروی گزینه افزودن مطابق تصویر و کامل کردن مقادیر خواسته شده، ناحیه ای ایجاد میشود، نکته حائز اهمیت مقدار منطقه است که یکی از مقادیر موجود در مناطق خودگردان است.',
        messageThree: 'امکان جستجو، ویرایش، حذف و افزودن مطابق تصویر می‌باشد. \n ✔️	تغییرات بطور گروهی و در سایر بخش های برنامه اعمال خواهد شد.',
      }
    else if (currentRoute === EN_Routes.rrkarbari)
      return {
        title: 'کاربری ها',
        messageOne: 'این بخش جهت مدیریت کاربری ها درنظر گرفته شده است. ',
        messageTwo: '✔️	وضعیت کنتور ها در اپلیکیشن قرائت، سایر بخش های برنامه ازجمله نمایش لیست مسیر ها کاربرد دارد.',
      }
    else if (currentRoute === EN_Routes.wrmrrcd)
      return {
        title: 'تنظیمات پیش‌فرض',
        messageOne: 'این بخش جهت مدیریت تنظیمات پیش فرض در برنامه و اپلیکیشن اندروید درنظر گرفته شده است.',
        messageTwo: '✔️	در بخش های صدور لیست مقادیر پیش فرضی که در اینجا طبق نظر هر ناحیه مشخص شده اند وارد می گردند. \n ✔️	کلیه مقادیر قابلیت ویرایش دارند. ',
      }
    else if (currentRoute === EN_Routes.wrmrcs)
      return {
        title: 'وضعیت کنتور',
        messageOne: 'این بخش جهت مدیریت وضعیت کنتور ها درنظر گرفته شده است. '
      }
    else if (currentRoute === EN_Routes.Qotr)
      return {
        title: 'قطر انشعاب',
        messageOne: 'این بخش جهت مدیریت قطر انشعاب درنظر گرفته شده است'
      }
    else if (currentRoute === EN_Routes.wrSettingsWaterMark)
      return {
        title: 'واتر مارک',
        messageOne: '\n ✔️	جزئیات واترمارک بر روی تصویر(عکس گرفته شده) قابل ویرایش است. \n ✔️	توجه نمایید که فاصله از چپ و بالا بطور تقریبی نمایش داده میشود. '
      }
    else if (currentRoute === EN_Routes.wrmrrpk)
      return {
        title: 'نوع دوره قرائت',
        messageOne: 'این بخش جهت مدیریت نوع دوره های قرائت درنظر گرفته شده است. ',
        messageTwo: '✔️	شما میتوانید هر نوع دوره قرائتی ایجاد نمایید. \n ✔️	این قسمت برای اپلکیشن قرائت اندروید، صدور لیست، دوره قرائت و سایر بخش ها کاربرد دارد. '
      }
    else if (currentRoute === EN_Routes.readingPeriod)
      return {
        title: 'دوره قرائت',
        messageOne: 'این بخش جهت مدیریت دوره های قرائت درنظر گرفته شده است. ',
        messageTwo: '✔️	شما میتوانید هر دوره قرائتی ایجاد نمایید.'
      }
    else if (currentRoute === EN_Routes.ipFilter)
      return {
        title: 'فیلتر IP',
        messageOne: 'نحوه عملکرد مسدود کردن آی پی ها: بصورت پیش فرض تمامی محدوده آی پی ها (ip range) اجازه دسترسی ندارند و در واقع کلیه آی پی ها مسدود شده تلغی میشوند مگر اینکه با تعریف Rule هایی این قاعده ملغی شود. بعلاوه این امکان وجود دارد که یک محدوده مجاز (white list) برای آی پی ها تعریف شود و درون همان محدوده مجاز مجدداً یک یا چند آی پی مسدود شوند. برای مثال میتوان تعریف کرد که از 10.0.0.1 تا 10.0.0.255 مجاز شمرده شود اما استثنائاً 10.0.0.127 غیرمجاز باشد، نوع قاعده تعریف شده (white list یا black list بودن) با گزینه «مجاز» (بصورت چک باکس) در تعریف محدوده های مجاز یا غیرمجاز تعیین میگردد. پس از اجرای نرم افزار مقدار اولیه مجاز تعیین شده بصورت 0.0.0.0 تا 255.255.255.255 میباشد (کلیه ی آی پی ها مجاز شمرده میشوند) تا راهبر سامانه بنا به صلاحدید و نیاز های کارفرما اقدام به تغییر سیاست های محدود های مرتبط با IP نماید.',
        messageTwo: 'درصورت مسدودیت هرکاربر، لازم است تا کاربر بصورت دستی توسط اپراتور از برنامه خارج شود (در قسمت مدیریت کاربران) و یا با اولین ورود به برنامه از مسدود بودن IP خود مطلع خواهد شد'
      }
    else if (currentRoute === EN_Routes.counterReport)
      return {
        title: 'گزارش بازرسی',
        messageOne: 'این بخش جهت مدیریت گزارش های بازرسی درنظر گرفته شده است. ',
        messageTwo: '✔️	شما میتوانید طبق نیاز ناحیه  هر گزارشی ایجاد نمایید. \n ✔️	گزارشها در اپلیکیشن قرائت اندروید و سایر بخش ها کاربرد دارد. '
      }
    else if (currentRoute === EN_Routes.wrmrapk)
      return {
        title: 'مدیریت apk',
        messageOne: '\n ✔️	درصورتی که نیاز به استفاده از آخرین APK وجود دارد برروی دانلود فایل کلیک نمایید. \n ✔️	برای ایجاد نسخه جدید با وارد کردن نام، کد و فایل نسخه میتوان به ایجاد نسخه جدید اقدام نمود. ',
      }
    else if (currentRoute === EN_Routes.rrimageAttribution)
      return {
        title: 'توصیف تصاویر',
        messageOne: 'جهت اصلاح تصاویر در سایر بخش ها، علت اصلاح تصویر در این بخش تعریف می‌شود.',
      }
    else if (currentRoute === EN_Routes.textOutputManager)
      return {
        title: 'تکست خروجی',
        messageOne: 'مدیریت چیدمان فایل تکست خروجی جهت ادغام با نرم افزار امور مشترکین استفاده می‌شود. ',
      }
    else if (currentRoute === EN_Routes.guild)
      return {
        title: 'مدیریت اصناف',
        messageOne: 'جهت مدیریت اصناف در اپلیکیشن قرائت و سایر بخش های برنامه ایجاد شده است. ',
      }
    else if (currentRoute === EN_Routes.dynamicTraverse)
      return {
        title: 'پیمایش پویا',
        messageOne: 'جهت مدیریت مقادیر پیمایش پویا در اپلیکیشن اندروید',
        messageTwo: 'تغییرات بطور گروهی و برای کلیه دستگاه های دارای اپلیکیشن قرائت اعمال خواهد شد.',
      }
    else if (currentRoute === EN_Routes.wrimpimd)
      return {
        title: 'ایجاد مسیر',
        messageOne: 'این بخش جهت ایجاد مسیر برای قرائت کننده‌ها درنظر گرفته شده است. به دو طریق میتوان مسیری ایجاد کرد. یک: از طریق دوره زمانی دو: بر اساس تاریخ.',
        imgOne: 'assets/imgs/help/tracking/impd1.JPG',
        messageTwo: 'تنها کافیست موارد مربوطه کامل شود تا مسیری ایجاد گردد. نکته: جهت صدور لیست لازم است دسترسی به "مشاهده دیکشنری" ها در قسمت مدیریت کاربران => مدیریت سامانه ها به کاربر داده شده باشد.',
        messageThree: '\n ✔️ درصورتی که گزینه "نمایش شماره اشتراک" فعال بود، پیش از صدور لیست، پیامی برای تایید لیستی که شامل تعداد اشتراک ها و تعداد خطا است نمایش داده میشود که درصورت تایید، لیست صادر خواهد شد. \n ✔️ هشدار به مواردی مثل ده(۱۰) کاراکتره نبودن کد پستی، خالی بودن قطر کنتور و... است که در روند قرائت ایجاد مشکل نمیکنن اما به هر حال بهتر است که رفع شوند. خطاها مواردی هستند که باعث میشن یک اشتراک قرائت نشه مثل، خالی بودن همزمان تاریخ قرائت قبلی و تاریخ نصب. دیدن جزئیات از طریق بخش صدور لیست/خطا ها و یا با داشتن شماره پیگیری از طریق بخش صدور لیست/خطای صدور. \n ✔️ تا زمانی که پیامی به شکل بالا(لیست صادر شد) نمایش داده نشده، مسیری ایجاد نشده است. \n ✔️ امکان ویرایش مقادیر مانند درصد علی‌الحساب و درصد تصویر وجود دارد. درصورتی که نیاز به تغییر مقادیر پیش فرض در ناحیه بود، به بخش مدیریت قرائت/تنظیمات پیش فرض مراجعه شود. \n ✔️ بعد از صدور، لیست صادر شده به بخش کارتابل/صادر شده انتقال داده میشود. ',
        imgTwo: 'assets/imgs/help/tracking/impd3.JPG',
      }
    else if (currentRoute === EN_Routes.wrmdbf)
      return {
        title: 'دانلود خروجی',
        messageOne: 'این بخش برای دریافت فایل های متعدد(dbf) طراحی شده است',
        imgOne: 'assets/imgs/help/dbf/dbf.JPG',
        messageTwo: 'کافی است پس از وارد کردن مقادیر، برروی دانلود فایل کلیک نمایید.',
      }
    else if (currentRoute === EN_Routes.wrmmserr)
      return {
        title: 'همه خطاهای صادر شده',
        messageOne: 'خطاهایی که در برنامه (مانند دسترسی غیر مجاز- خطای سرور و ..) صادر شده قابل مشاهده هستند. درصورت عدم انتخاب گزینه ای، کلیه خطاها نمایش داده می شوند.',
        messageTwo: '✔️	همچنین امکان بررسی فنی تر خطا همراه با جزئیات با انتخاب آخرین ستون (آیکن) قابل پیگیری می باشد.',
      }
    else if (currentRoute === EN_Routes.userActivation)
      return {
        title: 'حساب کاربران',
        messageOne: 'نمایش نوع فعالیت/ها حساب کاربران',
        messageTwo: '✔️	حداقل یک نوع فعالیت برای نمایش انتخاب گردد.',
      }
    else if (currentRoute === EN_Routes.wrmms)
      return {
        title: 'مدیریت سرور', messageOne: '\n ✔️	ریست IIS : امکان ریست کردن IIS وجود دارد. \n ✔️	ریست اپلیکیشن: ریست کردن اپلیکیشن، با اعمال این تغییر برای لحظاتی سرور پاسخگو نخواهد بود. \n ✔️	حذف خطاها: حذف همه ی خطاهای سرور \n ✔️	آفلاین کردن اَپ \n ✔️	Health: بررسی تخصصی سلامت سرویس دهنده قابل مشاهده است. \n ✔️	Jobs: بررسی کار های درحال انجام یا انجام شده دستگاه و همچنین عملکرد سرویس دهنده در شرایط مختلف قابل مشاهده است. \n ✔️	افزایش زمان: افزایش زمان License \n ✔️	کاهش زمان: کاهش زمان License  \n ✔️	پایان زمان: پایان اعتبار License  \n ✔️	اعتبار سنجی: بررسی مجدد اعتبار سنجی',
        messageTwo: 'ممکن است برخی از تغییرات به دسترسی بیشتری نیاز داشته باشند.',
      }
    else if (currentRoute === EN_Routes.wrmRequestLogsAnonymous)
      return {
        title: 'Log درخواست ها',
        messageOne: 'با تعیین بازه مشخص، کلیه درخواست های لاگ شده نمایش داده می شوند. \n ✔️بازه زمانی پیش فرض یکساعت درنظر گرفته شده است.',
      }
    else if (currentRoute === EN_Routes.reqLogUser)
      return {
        title: 'درخواست کاربر',
        messageOne: 'با تعیین بازه زمانی مشخص، درخواست های کاربرانی که احزار هویت آنها با موفقیت تایید گردیده نمایش داده می شوند. \n✔️ بازه زمانی پیش فرض یکساعت درنظر گرفته شده است.',
      }
    else if (currentRoute === EN_Routes.serverIPSpecialRules)
      return {
        title: 'Anti DOS',
        messageOne: 'اعمال محدودیت ورود به سامانه از طریق IP، و End point در دوره  زمانی مشخص و محدودیت تعداد  درخواست برای حداکثر تعداد درخواست.',
      }
    else if (currentRoute === EN_Routes.serverOSInfo)
      return {
        title: 'اطلاعات سرور',
        messageOne: 'اطلاعات سخت افزاری و نرم افزاری درحال استفاده سرویس دهنده قابل مشاهده است.',
        messageTwo: '✔️	زمان فعالیت: از آخرین زمانی که خاموش یا ریست شده است تاکنون محاسبه میشود \n ✔️	زمان: زمان فعلی سرور است. '
      }
    else if (currentRoute === EN_Routes.driveInfo)
      return {
        title: 'حافظه',
        messageOne: 'وضعیت کلی حافظه درحال استفاده ی سرویس دهنده از جمله فضای کل درحال استفاده، درصد فضای آزاد، فضای رزرو شده و .. قابل مشاهده است.',
      }
    else if (currentRoute === EN_Routes.wrmfbn)
      return {
        title: 'اطلاعات غیرمجاز',
        messageOne: 'کل اطلاعات غیرمجاز در این بخش ثبت میشود. ',
        messageTwo: 'همچنین درصورتی که عکسی ارسال شده باشد با کلیک برروی آیکن مربوطه قابل مشاهده است.',
      }
    if (currentRoute === EN_Routes.wrmlpd)
      return {
        title: 'اطلاعات روزانه',
        messageOne: 'جزئیات بیشتر یک لیست درحال قرائت توسط قرائت کننده از جمله اطلاعات قرائت و اطلاعات مکانی قابل مشاهده است.',
        messageTwo: 'درصورت نیاز به مشاهده موقعیت مکانی قرائت کننده و اشتراک های ثبت شده برروی نقشه نیز برروی مشاهده برروی نقشه کلیک نمایید.',
      }
    else if (currentRoute === EN_Routes.followUp)
      return {
        title: 'پیگیری موردی',
        messageOne: 'این بخش جهت پیگیری کلیه مسیر/لیست ها ایجاد شده است. جزئیات نمایشی بیشتر مانند تاریخ ثبت، نام قرائت کننده و وضعیت پیگیری قابل مشاهده هستند. ',
        messageTwo: '✔️	میتوان مسیر/لیست را به قسمت قبلی بازگشت داد. برای مثال اگر مسیر در وضعیت درحال قرائت باشد میتواند به وضعیت بارگیری شده بازگشت داده شود. برای مشاهده "درصد مانع صادر شده" برروی "درصد مانع" کلیک نمایید . \n ✔️	امکان مشاهده گرافِ روند پیموده شده مسیر بطور خلاصه قابل مشاهده است. \n ✔️	امکان مشاهده وضعیت در صورت وجود نقشه نیز ارائه شده است. ',
      }
    else if (currentRoute === EN_Routes.wrmssearchMosh)
      return {
        title: 'جستجوی مشترک',
        messageOne: 'درجستجوی مشترک به چهار نوع جستجو میتوان اقدام نمود.( شماره پرونده- اشتراک- قرائت- شناسه قبض)',
        imgOne: 'assets/imgs/help/search/search_mosh.JPG',
        messageTwo: 'جستجوی موارد مشابه بمعنای جستجوی تقریبی مقادیر است و نه فقط مقدار وارد شده.',
        messageThree: 'نمایش همه: مواردی که به علت بازدید یا اصلاح لیست تغییر کرده اند نمایش داده خواهند شد. \n ✔️	امکان مشاهده خلاصه کاردکس نیز وجود دارد.',
      }
    else if (currentRoute === EN_Routes.wrmsacme)
      return {
        title: 'جستجوی تجمیعی',
        messageOne: '\n ✔️	امکان دانلود فایل Excel  بجای نمایش در جدول وجود دارد. در بازه های طولانی مدت، جهت تسریع در نمایش اطلاعات این قسمت کاربرد دارد. \n ✔️	لیست قرائت جستجو شده در این قسمت قابل مشاهده می باشد \n ✔️	نمایش همه: مواردی که به علت بازدید یا اصلاح لیست تغییر کرده اند نیز نمایش داده خواهد شد. \n ✔️	فیلتر نمایش با استفاده از مقادیر سمت چپ(مانند وضعیت مصرف- گزارش بازرسی و ..) جهت بهبود جستجو ارائه شده است. ',
      }
    else if (currentRoute === EN_Routes.wrmssimple)
      return {
        title: 'پیگیری',
        messageOne: 'این بخش جهت پیگیری کلیه مسیرها/لیست ها ایجاد شده است براساس ناحیه و بازه ی تاریخی ایجاد شده است. این قسمت مشابه با پیگیری موردی است، تفاوت در مشاهده و پیگیری کلیه لیست های صادر شده است.',
        messageTwo: '✔️	بررسی دقیقتر هر مورد در پیگیری موردی قابل مشاهده می باشد. \n ✔️	امکان بررسی هر مورد در اطلاعات روزانه نیز وجود دارد. \n ✔️	امکان مشاهده لیست قرائت وجود دارد. \n ✔️	امکان نمایش در نقشه وجود دارد. '
      }
    else if (currentRoute === EN_Routes.wrprofile)
      return {
        title: 'تنظیمات کاربری',
        messageOne: 'شخصی سازی تنظیمات هر کاربر از منوی بالای صفحه قابل دسترس است. ',
        messageTwo: '✔️	مشخصات کلی کاربر: اطلاعات کلی شما را نمایش می دهد. \n ✔️	تغییر گذرواژه: میتوانید گذرواژه خود را تغییر دهید. به یاد داشتن گذرواژه فعلی الزامی است. درصورتی که گذرواژه قبلا بازنشانی شده باشد، شماره همراه گذرواژه فعلی است. \n ✔️	نمایش تصاویر: اندازه و فرم کلیه تصاویری که در قسمت های مختلف برنامه مشاهده میشوند قابل تغییر است.  \n ✔️	جستجو بر اساس: در بخش های مختلف برنامه بر اساس نیاز خود میتوانید نوع جستجو را تغییر داده تا دسترسی به داده مورد نیاز تسریع یابد. \n ✔️	امکان لغو درخواست: درصورت فعال بودن این گزینه امکان لغو درخواست درحال انجام وجود دارد. \n ✔️	اندازه فونت: با توجه سلیقه خود، اندازه کلیه متن ها و فاصله ها را کنترل نمایید. \n ✔️	مکان اعلان پیام ها: مکان اعلان ها( پیام ها) در صفحه قابل جابجایی است. \n ✔️	امکان جابجایی ستونها: ستونهای جداول طبق سلیقه و نیاز شما قابل جابجایی هستند. \n ✔️	گروه بندی پیش فرض در کارتابل: با فعال بودن این گزینه، برخی جداول امکان گروه بندی محتوا براساس نیاز شما را خواهند داشت. \n ✔️	بازگشت به تنظیمات پیش فرض: کلیه مواردی که در این صفحه ذکر شد، قابل بازگشت به مقادیر پیش فرض را خواهند داشت. ',
        messageThree: 'کلیه موارد ذکر شده، با یکبار تغییر، در برنامه ذخیره شده و نیاز به تنظیم مجدد ندارند.',
      }
    else if (currentRoute === EN_Routes.wrmtrackimported)
      return {
        title: 'لیست صادر شده',
        messageOne: 'این بخش جهت رهگیری وضعیت قرائت می باشد. از زمانی که مسیر/لیست ایجاد میشود، مسیر در قسمت صادر شده قرار میگیرد. به محض آنکه از طریق اپلیکیشن قرائت بارگیری انجام گیرد، مسیر به قسمت دریافت شده منتقل میشود. پس از آن با ثبت اولین اشتراک توسط قرائت کننده به قسمت در حال قرائت منتقل و قابل پیگیری همزمان خواهد شد. و پس از پایان قرائت و بارگذاری عملیات، لیست/مسیر به قسمت بارگذاری شده/اصلاح لیست و درصورت بارگیری به دانلود شده منتقل خواهد شد. \n ✔️	در کارتابل همواره می توان یک مسیر/لیست را در شماره پیگیری بررسی نمود. \n ✔️	جهت بهبود فرایند و راحتی کارشناسان چند نمونه لیست (کلیه اشتراک ها مربوط به یک مسیر/ لیست) در این بخش قرار داده شده است. \n ✔️	در هر مرحله میتوان به مرحله قبل بازگشت به این معنی که یک مسیر/لیست را میتوان به مرحله قبل بازگشت داد. \n ✔️	حذف یا بازگشت مسیر/لیست با ارائه توضیح قابل انجام است. \n ✔️	درصورتی امکان حذف یا بازگشت مسیر/لیست وجود دارد که کاربر دسترسی به این قسمت را داشته باشد. کنترل دسترسی ها در بخش مدیریت کاربران/ویرایش قابل انجام است. \n ✔️	درصورتی که گروه بندی فعال باشد(بخش تنظیمات کاربری)، امکان گروه بندی وجود دارد. ',
        messageTwo: 'مشاهده جزئیات و ویرایش: علاوه بر مشاهده جزئیات بیشتر لیست صادر شده، میتوان لیست را ویرایش کرد، برای مثال میتوان قرائت کننده را تغییر داد.',
        messageThree: 'لیست مسیر ها بروز رسانی می شود یعنی تنها تا قبل از بارگیری توسط قرائت کننده در این قسمت قابل مشاهده است.',
      }
    else if (currentRoute === EN_Routes.wrmtrackloaded)
      return {
        title: 'لیست بارگیری شده توسط قرائت کننده',
        messageOne: 'این بخش جهت رهگیری وضعیت قرائت می باشد. از زمانی که مسیر/لیست ایجاد میشود، مسیر در قسمت صادر شده قرار میگیرد. به محض آنکه از طریق اپلیکیشن قرائت بارگیری انجام گیرد، مسیر به قسمت دریافت شده منتقل میشود. پس از آن با ثبت اولین اشتراک توسط قرائت کننده به قسمت در حال قرائت منتقل و قابل پیگیری همزمان خواهد شد. و پس از پایان قرائت و بارگذاری عملیات، لیست/مسیر به قسمت بارگذاری شده/اصلاح لیست و درصورت بارگیری به دانلود شده منتقل خواهد شد. \n ✔️	در کارتابل همواره می توان یک مسیر/لیست را در شماره پیگیری بررسی نمود. \n ✔️	جهت بهبود فرایند و راحتی کارشناسان چند نمونه لیست (کلیه اشتراک ها مربوط به یک مسیر/ لیست) در این بخش قرار داده شده است. \n ✔️	در هر مرحله میتوان به مرحله قبل بازگشت به این معنی که یک مسیر/لیست را میتوان به مرحله قبل بازگشت داد. \n ✔️	حذف یا بازگشت مسیر/لیست با ارائه توضیح قابل انجام است. \n ✔️	درصورتی امکان حذف یا بازگشت مسیر/لیست وجود دارد که کاربر دسترسی به این قسمت را داشته باشد. کنترل دسترسی ها در بخش مدیریت کاربران/ویرایش قابل انجام است. \n ✔️	درصورتی که گروه بندی فعال باشد(بخش تنظیمات کاربری)، امکان گروه بندی وجود دارد. ',
        messageTwo: 'با بارگیری مسیر/لیست توسط قرائت کننده، مسیر به این قسمت منتقل میشود. لیست مسیر های بارگذاری شده توسط تمامی قرائت کننده ها قبل از شروع قرائت در این قسمت هستند.',
      }
    else if (currentRoute === EN_Routes.wrmtrackreading)
      return {
        title: 'درحال قرائت',
        messageOne: 'این بخش جهت رهگیری وضعیت قرائت می باشد. از زمانی که مسیر/لیست ایجاد میشود، مسیر در قسمت صادر شده قرار میگیرد. به محض آنکه از طریق اپلیکیشن قرائت بارگیری انجام گیرد، مسیر به قسمت دریافت شده منتقل میشود. پس از آن با ثبت اولین اشتراک توسط قرائت کننده به قسمت در حال قرائت منتقل و قابل پیگیری همزمان خواهد شد. و پس از پایان قرائت و بارگذاری عملیات، لیست/مسیر به قسمت بارگذاری شده/اصلاح لیست و درصورت بارگیری به دانلود شده منتقل خواهد شد. \n ✔️	در کارتابل همواره می توان یک مسیر/لیست را در شماره پیگیری بررسی نمود. \n ✔️	جهت بهبود فرایند و راحتی کارشناسان چند نمونه لیست (کلیه اشتراک ها مربوط به یک مسیر/ لیست) در این بخش قرار داده شده است. \n ✔️	در هر مرحله میتوان به مرحله قبل بازگشت به این معنی که یک مسیر/لیست را میتوان به مرحله قبل بازگشت داد. \n ✔️	حذف یا بازگشت مسیر/لیست با ارائه توضیح قابل انجام است. \n ✔️	درصورتی امکان حذف یا بازگشت مسیر/لیست وجود دارد که کاربر دسترسی به این قسمت را داشته باشد. کنترل دسترسی ها در بخش مدیریت کاربران/ویرایش قابل انجام است. \n ✔️	درصورتی که گروه بندی فعال باشد(بخش تنظیمات کاربری)، امکان گروه بندی وجود دارد. ',
        imgOne: 'assets/imgs/help/tracking/reading3.JPG',
        messageTwo: 'این قسمت جهت پگیری آنی و درلحظه اشتراک های ثبت شده می‌باشد.',
        messageThree: '\n ✔️	 اتمام قرائت: درصورتی که به هر علتی قرائت کننده قادر به اتمام فرایند قرائت نبود، از این گزینه استفاده میشود. \n ✔️	مشاهده اطلاعات روزانه : امکان مشاهده اطلاعات کلی قرائت کننده درحال قرائت و همچنین آخرین مکان(اشتراک- زمان) ثبت شده و مسیر طی شده برروی نقشه. \n ✔️	مشاهده لیست قرائت: لیست کلیه مشترکین در مسیر، همراه با جزئیات بیشتر و همچنین مشاهده تصاویر یا صوت بارگذاری شده در لحظه. لیست کلیه مسیر های در حال قرائت تا قبل از تخلیه اطلاعات توسط قرائت کننده در این قسمت قابل مشاهده است. \n ✔️	برای غیرفعال کردن گروه بندی به بخش تنظیمات، جدول مراجعه نمایید',
      }
    else if (currentRoute === EN_Routes.wrmtrackoffloaded)
      return {
        title: 'بارگذاری شده',
        messageOne: 'این بخش جهت رهگیری وضعیت قرائت می باشد. از زمانی که مسیر/لیست ایجاد میشود، مسیر در قسمت صادر شده قرار میگیرد. به محض آنکه از طریق اپلیکیشن قرائت بارگیری انجام گیرد، مسیر به قسمت دریافت شده منتقل میشود. پس از آن با ثبت اولین اشتراک توسط قرائت کننده به قسمت در حال قرائت منتقل و قابل پیگیری همزمان خواهد شد. و پس از پایان قرائت و بارگذاری عملیات، لیست/مسیر به قسمت بارگذاری شده/اصلاح لیست و درصورت بارگیری به دانلود شده منتقل خواهد شد. \n ✔️	در کارتابل همواره می توان یک مسیر/لیست را در شماره پیگیری بررسی نمود. \n ✔️	جهت بهبود فرایند و راحتی کارشناسان چند نمونه لیست (کلیه اشتراک ها مربوط به یک مسیر/ لیست) در این بخش قرار داده شده است. \n ✔️	در هر مرحله میتوان به مرحله قبل بازگشت به این معنی که یک مسیر/لیست را میتوان به مرحله قبل بازگشت داد. \n ✔️	حذف یا بازگشت مسیر/لیست با ارائه توضیح قابل انجام است. \n ✔️	درصورتی امکان حذف یا بازگشت مسیر/لیست وجود دارد که کاربر دسترسی به این قسمت را داشته باشد. کنترل دسترسی ها در بخش مدیریت کاربران/ویرایش قابل انجام است. \n ✔️	درصورتی که گروه بندی فعال باشد(بخش تنظیمات کاربری)، امکان گروه بندی وجود دارد. ',
        messageTwo: 'زمانی که قرائت کننده پس از پایان قرائت انجام شده، اقدام به بارگذاری(تخلیه) مینماید، لیست قرائت به این قسمت منتقل میشود. درصورت نیاز به اصلاح یا بررسی لیست، دو نوع اصلاح وجود دارد. برروی آیکن اصلاح لیست و یا اصلاح کلی لیست کلیک نمایید.',
        messageThree: '\n ✔️	 دانلود فایل: با کلیک برروی دانلود فایل ، فایل شما به قسمت دانلود مرورگر منتقل خواهد شد. \n ✔️	درصورتی که مدیران برنامه تاریخ قرائت بعدی را فعال کرده باشند، تعیین تاریخ قرائت بعدی، پس از کلیک برروی دانلود فایل الزامی است. \n ✔️	پس از دانلود، این مسیر به قسمت دانلود شده منتقل و تا مدت محدود قابل مشاهده است. \n ✔️	بازدید زمانی قابل مشاهده است که شماره لیست وجود داشته باشد. با کلیک این آیکن امکان مشاهده بازدید وجود دارد. ',
      }
    else if (currentRoute === EN_Routes.trackOffloadedMaster)
      return {
        title: 'اصلاح لیست 2',
        messageOne: 'پس از ایجاد هر نوبتی امکان مشاهده نوبتی ایجاد شده و همچنین مسیر های هر نوبتی وجود دارد.',
        messageTwo: '\n ✔️ جهت اصلاح کلیه نوبتی از گزینه اصلاح 2 استفاده نمایید.  ✔️	دانلود فایل Excel: فایل اکسل نوبتی به قسمت دانلود مرورگر منتقل خواهد شد. \n ✔️ تغییر تاریخ (اصلاح لیست): اصلاح لیست براساس میانگین روزانه و تاریخ انتخابی کاربر، مصرف و رقم کنتور بصورت برآوردی محسابه شده و اصلاح لیست صورت می پذیرد.  \n اشتراک هایی که رقم قرائت ندارند، مستثنا هستند. \n درصورت نیاز به اصلاح موارد خاص، کاربر نیازمند اصلاح موارد بصورت دستی است. ',
        messageThree: '✔️ جهت مشاهده و اصلاح مسیر های هر نوبتی برروی آیکن «🔽» کلیک نمایید'
      }
    else if (currentRoute === EN_Routes.wrmtrackoffloadedGroup)
      return {
        title: 'اصلاح لیست',
        messageOne: 'زمانی که قرائت کننده پس از پایان قرائت انجام شده، اقدام به بارگذاری(تخلیه) مینماید، لیست قرائت به این قسمت منتقل میشود. درصورت نیاز به اصلاح یا بررسی لیست، برروی آیکن اصلاح کلی لیست(دسته ای) کلیک نمایید. اصلاح لیست همان بارگذاری شده است. تفاوت در نوع اصلاح لیست می باشد. بصورتی که بطور دسته ای و بر روی جدول اصلاح انجام می گیرد.',
        messageTwo: '✔️	دانلود فایل: با کلیک برروی دانلود فایل ، فایل شما به قسمت دانلود مرورگر منتقل خواهد شد و مسیر/لیست از قسمت بارگذاری شده/ اصلاح لیست به دانلود شده منتقل می شود. \n ✔️	درصورتی که مدیران برنامه تاریخ قرائت بعدی را فعال کرده باشند، تعیین تاریخ قرائت بعدی، پس از کلیک برروی دانلود فایل الزامی است. \n ✔️	پس از دانلود، این مسیر به قسمت دانلود شده منتقل و تا مدت محدود قابل مشاهده است. \n ✔️	بازدید زمانی قابل مشاهده است که شماره لیست وجود داشته باشد. با کلیک برروی این آیکن امکان مشاهده بازدید وجود دارد. ',
      }
    else if (currentRoute === EN_Routes.wrmtrackfinished) {
      return {
        title: 'دانلود شده',
        messageOne: 'مسیر/ لیست های بارگذاری، پس از دانلود به این قسمت منتقل می شوند. و قابلیت دانلود مجدد را تا مدت محدود دارند یعنی با دانلود مسیر، مسیر در این قسمت جابجا نمی شود و پس از مدتی برنامه بطور خودکار آنرا نمایش نخواهد داد.',
        messageTwo: '✔️	درصورتی که مدیران برنامه تاریخ قرائت بعدی را فعال کرده باشند، تعیین تاریخ قرائت بعدی، پس از کلیک برروی دانلود فایل الزامی است.'
      }
    }
    else if (currentRoute === EN_Routes.wrmtracklatest)
      return {
        title: 'آخرین وضعیت',
        messageOne: 'اطلاعات جمع آوری شده ی کارتابل در این قسمت نیز قابل پیگیری است. یعنی کلیه روند کارتابل از صدور لیست تا دانلود شده در این قسمت قابل پیگیری است.',
        messageTwo: '✔️	امکان مشاهده وضعیت در صورت وجود نقشه نیز ارائه شده است.',
      }
    else if (currentRoute === EN_Routes.wrmlalltrue)
      return {
        title: 'لیست بارگذاری شده',
        messageOne: 'لیست یا مسیر به مجموعه اشتراک هایی که مربوط به یک شماره پیگیری باشد گفته که پس از صدور لیست ایجاد می شود. درواقع هر قرائتی که توسط قرائت کننده ثبت می شود برروی لیست اعمال می گردد. از جمله تصویر، صوت، پیمایش، غیرمجاز و هر نوع گزارش دیگر.',
        imgOne: 'assets/imgs/help/offloadmodify/allmodify.JPG',
        messageTwo: '✔️	تفاوت این لیست در نوع اصلاح است، بدین صورت که جزئیات هر اشتراک نمایش داده شده و قابلیت اصلاح بصورت موردی(تکی) را دارد.  \n ✔️	جهت بررسی و ویرایش تکی هر اشتراک. \n ✔️	امکان مشاهده خلاصه کاردکس وجود دارد. \n ✔️	امکان مشاهده سابقه نیز وجود دارد.'
      }
    else if (currentRoute === EN_Routes.wrmlallfalse)
      return {
        title: 'لیست قرائت',
        messageOne: 'لیست یا مسیر به مجموعه اشتراک هایی که مربوط به یک شماره پیگیری باشد گفته که پس از صدور لیست ایجاد می شود. درواقع هر قرائتی که توسط قرائت کننده ثبت می شود برروی لیست اعمال می گردد. از جمله تصویر، صوت، پیمایش، غیرمجاز و هر نوع گزارش دیگر.',
        imgOne: 'assets/imgs/help/woui/woui.JPG',
        messageTwo: '✔️	فقط قرائت شده برای تفکیک و مدیریت بهتر اشتراک های قرائت شده و نشده قرار داده شده است. \n ✔️	در صورتی که صوت یا تصویر موجود باشد، رنگ آیکن مربوطه(عکس) تغییر میکند. \n ✔️	با حرکت اشاره گر به علائم وضعیت مصرف، متن وضعیت مصرف نمایش داده می شود. \n ✔️	امکان مشاهده اشتراک برروی نقشه وجود دارد. \n ✔️	امکان مشاهده گزارش بازرسی وجود دارد. \n ✔️	چند نوع لیست در برنامه وجود دارد.'
      }
    else if (currentRoute === EN_Routes.wrmlGeneralModify)
      return {
        title: 'اصلاح کلی',
        messageOne: 'لیست یا مسیر به مجموعه اشتراک هایی که مربوط به یک شماره پیگیری باشد گفته که پس از صدور لیست ایجاد می شود. درواقع هر قرائتی که توسط قرائت کننده ثبت می شود برروی لیست اعمال می گردد. از جمله تصویر، صوت، پیمایش، غیرمجاز و هر نوع گزارش دیگر.',
        imgOne: 'assets/imgs/help/woui/woui.JPG',
        messageTwo: '✔️	جهت بررسی و ویرایش کلی لیست، با قابلیت درج نوع اصلاح برای هر اشتراک و همچنین دسته بندی بر اساس وضعیت کنتور. \n ✔️	تفاوت اصلاح لیست در این قسمت در خطی بودن ویرایش هر سطر(اشتراک) است و ذخیره تکی هر تغییر است.',
        messageThree: '\n ✔️	فقط قرائت شده برای تفکیک و مدیریت بهتر اشتراک های قرائت شده و نشده قرار داده شده است. \n ✔️	در صورتی که صوت یا تصویر موجود باشد، رنگ آیکن مربوطه(عکس) تغییر میکند. \n ✔️	با حرکت اشاره گر به علائم وضعیت مصرف، متن وضعیت مصرف نمایش داده می شود. \n ✔️	امکان مشاهده اشتراک برروی نقشه وجود دارد. \n ✔️	امکان مشاهده گزارش بازرسی وجود دارد. \n ✔️	چند نوع لیست در برنامه وجود دارد. \n ✔️	امکان مشاهده خلاصه کاردکس وجود دارد. \n ✔️	امکان مشاهده سابقه نیز وجود دارد. \n ✔️	ستون اصلاح انتخاب شده یعنی اشتراک قبلا توسط کاربر(اپراتور) برنامه اصلاح شده است.'
      }
    else if (currentRoute === EN_Routes.wrmlGeneralGModify)
      return {
        title: 'اصلاح کلی(دسته‌ای)',
        messageOne: 'لیست یا مسیر به مجموعه اشتراک هایی که مربوط به یک شماره پیگیری باشد گفته که پس از صدور لیست ایجاد می شود. درواقع هر قرائتی که توسط قرائت کننده ثبت می شود برروی لیست اعمال می گردد. از جمله تصویر، صوت، پیمایش، غیرمجاز و هر نوع گزارش دیگر.',
        imgOne: 'assets/imgs/help/woui/woui.JPG',
        messageTwo: '✔️	جهت بررسی و ویرایش کلی لیست(دسته ای)، با قابلیت درج نوع اصلاح برای هر اشتراک و همچنین دسته بندی بر اساس وضعیت کنتور. \n ✔️	تفاوت اصلاح کلی لیست(دسته ای) در این قسمت در خطی بودن ویرایش هر سطر(اشتراک) و درعین حال ذخیره همه تغییرات بطور دسته ای است. \n ✔️	ستونهایی امکان ویرایش دارند که رنگی هستند \n ✔️	درصورتی که مقدار نوع اصلاح " انتخاب کنید" باشد ویرایش آن مورد صورت نخواهد گرفت.',
        messageThree: '\n ✔️	فقط قرائت شده برای تفکیک و مدیریت بهتر اشتراک های قرائت شده و نشده قرار داده شده است. \n ✔️	در صورتی که صوت یا تصویر موجود باشد، رنگ آیکن مربوطه(عکس) تغییر میکند. \n ✔️	با حرکت اشاره گر به علائم وضعیت مصرف، متن وضعیت مصرف نمایش داده می شود. \n ✔️	امکان مشاهده اشتراک برروی نقشه وجود دارد. \n ✔️	امکان مشاهده گزارش بازرسی وجود دارد. \n ✔️	چند نوع لیست در برنامه وجود دارد. \n ✔️	امکان مشاهده خلاصه کاردکس وجود دارد. \n ✔️	امکان مشاهده سابقه نیز وجود دارد. \n ✔️	ستون اصلاح انتخاب شده یعنی اشتراک قبلا توسط کاربر(اپراتور) برنامه اصلاح شده است.'
      }
    else if (currentRoute === EN_Routes.wrflashlr)
      return {
        title: 'آخرین قرائت شده‌ها',
        messageOne: 'با ثبت هر قرائت توسط قرائت کننده، بلافاصله جزئیات اشتراک ثبت شده برروی نقشه و جدول قابل پیگیری می باشد. با کلیک برروی نقطه ای که روی نقشه وجود دارد که همان مکان نسبی قرائت کننده است، جزئیات اشتراک نیز نمایش داده می شود.',
        messageTwo: 'با قرائت بعدی، اولین اشتراک ثبت شده(آخرین در جدول) جای خود را به اولین قرائت بعدی می دهد. \n ✔️	حداکثر تعداد اشتراک های روی جدول توسط کاربر قابل تعیین است'
      }
    else if (currentRoute === EN_Routes.realtimeMessage)
      return {
        title: 'پیام به کاربران آنلاین',
        messageOne: 'جهت مخابره پیامی برای کلیه کاربران آنلاین از این بخش استفاده می شود. پیام نمایش داده شده زماندار است. متن پیام، زمان و رنگ اعلان قابل تغییر است. همچنین با کلیک برروی دکلمه استفاده میتوان از پیام های پیش فرض استفاده نمود و یا آنرا به دلخواه تغییر نمود.',
      }
    else if (currentRoute === EN_Routes.wrpolicies)
      return {
        title: 'تنظیمات امنیتی',
        messageOne: 'امنیت سامانه قابل تغییر است. حداقل نویسه گذرواژه، تنوع گذرواژه، دفعات ورود با کپچا، Session  خودکار، استفاده همزمان از یک توکن از آن جمله اند.',
        messageTwo: 'ممکن است برخی از تغییرات به دسترسی بیشتری نیاز داشته باشند.'
      }
    else if (currentRoute === EN_Routes.policyHistory)
      return {
        title: 'تاریخچه تغییرات تنظیمات امنیتی',
        messageOne: 'با تغییر در تنظیمات امنیتی برنامه، جزئیات تغییرات داده شده در این قسمت نمایش داده می‌شود.',
      }
    else if (currentRoute === EN_Routes.userKarkardSummary)
      return {
        title: 'کاربر خلاصه عملکرد',
        messageOne: 'امکان نمایش عملکرد کاربر براساس تعداد مطابق با عملیات کارتابل وجود دارد. مثلا قرائت کننده‌ای در بازه زمانی دو روز دوبار بارگیری و دوبار بارگذاری کرده است.',
      }

  }
  /* DYNAMIC ROUTES */
  private similarIncludeRoute = (currentRoute: string): IHelpWrapper => {
    // show track position on map page
    if (currentRoute.includes(EN_Routes['wr;trackNumber=']))
      return {
        title: 'پیگیری درحال قرائت',
        messageOne: 'اشتراک های درحال قرائت با نقطه مشخص شده اند. با کلیک بروی هرکدام اطلاعات اشتراک مشخص میشود.',
        messageTwo: ' درصورت نیاز به مشاهده مسیر طی شده(اشتراک های ثبت شده) برروی زمان نمایش کلیک نمایید. زمان مشاهده براساس میلی ثانیه "ms" است.',
      }
    else if (currentRoute.includes(EN_Routes.wrmrformula))
      return {
        title: 'تعرفه ها',
        messageOne: 'امکان ایجاد و تغییر تعرفه در ناحیه ها ایجاد شده است. هر قسمت امکان افزودن تکی و افزودن دسته ای با استفاده از فایل Excel را دارد.',
        messageTwo: 'برای اطلاع از فایل قابل ارسال، نمونه فایل را جهت راهنمایی و استفاده دانلود نمایید و سپس با کلیک برروی افزودن فایل Excel فایل تکمیلی را ارسال نمایید.',
      }
    else if (currentRoute.includes(EN_Routes.wrmal))
      return {
        title: 'درخت دسترسی',
        messageOne: 'باتوجه به اینکه برنامه بصورت یکپارچه و با هدف پوشش استان های کشور، به صورت لایه ای درنظر گرفته شده است. قسمت درخت دسترسی از بخش های Appها، ماژول ها، کنترلر ها و اکشن ها بصورت طبقه ای تشکیل شده است. برای مثال بخش App ها شامل برنامه های کلی درحال استفاده می باشد مانند سامانه جامع قرائت کنتور. ماژول ها از سامانه قرائت کنتور و کنترلر ها از ماژول تشکیل شده اند. مثلا کنترلر های کاربری ها و وضعیت کنتور از ماژول مدیریت قرائت تشکیل شده است و مدیریت قرائت خود یک App است.',
        imgOne: 'assets/imgs/help/ARE.PNG',
        messageTwo: 'امکان جستجو، ویرایش، حذف و افزودن مطابق تصویر می‌باشد.',
      }
    else if (currentRoute === EN_Routes.wrmsacme)
      return {
        title: 'جستجوی تجمیعی',
        messageOne: 'لیست قرائت جستجو شده در این قسمت قابل مشاهده می باشد. درصورتی که عکس(ها) و یا صوتی گرفته شده باشد با کلیک برروی "بررسی عکس/صوت" قابل بررسی می باشد.',
      }
    else if (currentRoute === EN_Routes.rptsKarkardDaily)
      return {
        title: 'گزارش لیست قرائت کننده',
        messageOne: 'اشتراک های قرائت شده را با جزئیات نمایش میدهد. تیک نمایش همه برای نمایش لیست پس از قرائت است و توسط قرائت کننده بارگذاری انجام شده است.',
      }
    else if (currentRoute === EN_Routes.wrofflinetxtout)
      return {
        title: 'بارگذاری اطلاعات قرائت کننده',
        messageOne: 'کلیه اطلاعاتی که توسط قرائت کننده ثبت شده و در فرآیند ارسال با مشکل مواجه شده ارسال نمایید(لیست میتواند تصویر، صوت، غیرمجاز یا هر داده دیگری نیز باشد)',
      }
    else if (currentRoute === EN_Routes.offlineLoad)
      return {
        title: 'بارگیری اطلاعات قرائت کننده',
        messageOne: 'قرائت کننده‌ای که در دریافت لیست صادر شده با مشکل مواجه شده باشد، فایلی که در این قسمت دریافت میکند را به گوشی خود منتقل و فرایند قرائت را انجام میدهد',
      }
    else if (currentRoute === EN_Routes.downloadAI)
      return {
        title: 'دانلود روزانه',
        messageOne: 'دانلود کلیه عکس های گرفته شده توسط قرائت کننده براساس تاریخ و ناحیه',
      }
    else if (currentRoute === EN_Routes.uploadSingle)
      return {
        title: 'آپلود تکی',
        messageOne: 'امکان آپلود یک تصویر مربوط به لیست قرائت شده ارائه شده است. جهت مواقعی که آپلود تصویر توسط اپلیکیشن قرائت با مشکل مواجه شده باشد میتوان از این قسمت اقدام نمود.'
      }
    else if (currentRoute === EN_Routes.downloadAITwo)
      return {
        title: 'دانلود بازه ای',
        messageOne: 'دانلود کلیه عکس های گرفته شده توسط قرائت کننده براساس بازه تاریخی و ناحیه',
      }
    else if (currentRoute === EN_Routes.wrtoolsrandomImg)
      return {
        title: 'پایش تصاویر',
        messageOne: 'نمایش تصاویر گرفته شده توسط قرائت کننده براساس تاریخ.',
        messageTwo: 'توجه نمایید فیلتر نمایش در جزئیات تصاویر اعمال نخواهد شد. برای مثال اگر پس از فیلتر نمایش، یک تصویر نمایش داده شود، با انتخاب آن تصویر، جزئیات بیشتری نمایش داده میشود اما اگر تصویر بعدی یا قبلی انتخاب شود، کلیه تصاویر در دسترس خواهند بود و نه براساس فیلتر انجام گرفته.',
        messageThree: 'همچنین درصورت وجود توصیف تصاویر، امکان ثبت آن وجود دارد.'
      }
    else if (currentRoute === EN_Routes.wrToolsResultDetails)
      return {
        title: 'نتیجه پایش تصاویر',
        messageOne: 'نمایش تصاویر پایش شده براساس بازه تاریخی.',
        messageTwo: 'توجه نمایید فیلتر نمایش در جزئیات تصاویر اعمال نخواهد شد. برای مثال اگر پس از فیلتر نمایش، یک تصویر نمایش داده شود، با انتخاب آن تصویر، جزئیات بیشتری نمایش داده میشود اما اگر تصویر بعدی یا قبلی انتخاب شود، کلیه تصاویر در دسترس خواهند بود و نه براساس فیلتر انجام گرفته.',
        messageThree: 'همچنین درصورت وجود توصیف تصاویر، امکان ثبت آن وجود دارد.'
      }
    else if (currentRoute === EN_Routes.wrToolsResultDetails)
      return {
        title: 'نتیجه پایش (جدول)',
        messageOne: 'نمایش تصاویر پایش شده براساس بازه تاریخی و قابلیت انتخاب نوع توصیف تصویر و مشاهده نتیجه به شکل جدول.',
      }
    else if (currentRoute === EN_Routes.imageAttributionFileAnalyze)
      return {
        title: 'تحلیل تصاویر',
        messageOne: 'عنوان کلیه گزارشهایی که برروی تصاویر اعمال شده اند(مثلا کم نور، قرائت اشتباه و ..) برروی جدول ارائه می شوند. همچنین جهت تحلیل تصاویر گرفته شده نمودار متناسب با جدول نیز ارائه شده است.',
      }
    else if (currentRoute === EN_Routes.imageAttributionFileResult)
      return {
        title: 'کیفیت تصاویر',
        messageOne: 'عنوان کلیه گزارشهایی که برروی تصاویر اعمال شده اند(مثلا کم نور، قرائت اشتباه و ..) برروی جدول ارائه می شوند. این گزارش محدود به یک ناحیه نمی باشد و کلیه نواحی و قرائت کننده نیز نمایش داده می شوند.',
      }
    else if (currentRoute === EN_Routes.wrrptsgalleryai)
      return {
        title: 'گالری تصاویر',
        messageOne: 'نمایش تصاویر گرفته شده براساس شماره پیگیری. برای مثال میتوان لیست تصاویری که درکارتابل در مرحله درحال قرائت قرار دارد را مشاهده نمود.',
        messageTwo: 'امکان کلیک برروی هر تصویر برای مشاهده جزئیات اشتراکِ قرائت شده وجود دارد. ',
        messageThree: 'فیلتر نمایش در جزئیات تصاویر اعمال نخواهد شد. برای مثال اگر پس از فیلتر نمایش، یک تصویر نمایش داده شود، با انتخاب آن تصویر، جزئیات بیشتری نمایش داده میشود اما اگر تصویر بعدی یا قبلی انتخاب شود، کلیه تصاویر در دسترس خواهند بود و نه براساس فیلتر انجام گرفته.'
      }
    else if (currentRoute === EN_Routes.wrrptsmamkarkard)
      return {
        title: 'خلاصه وضعیت ها',
        messageOne: 'بررسی تعدادی از وضعیت های قرائت ارائه شده است. این قسمت بعلت بررسی وضعیت های ثبت شده برای مدیران و کارشناسان پرکاربرد می‌باشد. همچنین امکان مشاهده نموداری این گزارش وجود دارد.',
      }
    else if (currentRoute === EN_Routes.rrKarkardAllStates)
      return {
        title: 'همه وضعیت های قرائت شده',
        messageOne: 'بررسی کلیه وضعیت های قرائت ارائه شده است. این قسمت بعلت بررسی کلیه وضعیت های ثبت شده برای مدیران و کارشناسان پرکاربرد می‌باشد.',
      }
    else if (currentRoute === EN_Routes.reportOffloadKarkard)
      return {
        title: 'بارگذاری شده',
        messageOne: 'بررسی لیست قرائت شده قابل مشاهده است. مدت(h) به معنای مدت زمان قرائت تا بارگذاری شده است. و جزئیات لیست قرائت شده به تفکیک وضعیت ها.',
      }
    else if (currentRoute === EN_Routes.karkardByFragment)
      return {
        title: 'نوبتی- بارگذاری',
        messageOne: 'نمایش قرائت کننده ها به تفکیک روز، شماره پیگیری و تعدادی از وضعیت های کنتور.',
        messageTwo: '✔️	بازه زمانی قابل تغییر است.'
      }
    else if (currentRoute === EN_Routes.rptsKarkardDaily)
      return {
        title: 'روزانه',
        messageOne: '\n ✔️	بازه زمانی قابل تغییر است. \n ✔️	نمایش همه آن دسته از لیست هایی است که از بارگذاری شده برگشت داده شده اند(به درحال قرائت منتقل شده اند). ',
      }
    else if (currentRoute === EN_Routes.userKarkard)
      return {
        title: 'کاربر',
        messageOne: 'نمایش کلیه قرائت کننده ها براساس وضعیت کارتابل و بازه زمانی مشخص. ',
      }
    else if (currentRoute === EN_Routes.userKarkardSummary)
      return {
        title: 'کاربر- خلاصه',
        messageOne: 'نمایش وضعیت کارتابل کلیه کاربران در بازه زمانی مشخص. '
      }
    else if (currentRoute === EN_Routes.dataMiningAnalysis)
      return {
        title: 'آنالیز قرائت کننده',
        messageOne: 'بررسی دقیقتر عملکرد قرائت کننده در بازه دلخواه قابل مشاهده است. از جمله اطلاعات ارائه شده، تعداد قرائت، حداقل و حداکثر زمان بین دو قرائت، تعداد و درصد بسته ها و .. اشاره نمود. این قسمت بعلت آمار کلی قرائت های ثبت شده برای متخصصان آمار، مدیران و کارشناسان نیز پرکاربرد می‌باشد.',
      }
    else if (currentRoute === EN_Routes.disposalHours)
      return {
        title: 'پراکندگی ساعت قرائت',
        messageOne: 'بازه های دو ساعته از قرائت توسط قرائت کننده ها ارائه شده است. همچنین امکان مشاهده نموداری این گزارش وجود دارد. این قسمت بعلت آمار کلی قرائت های ثبت شده برای متخصصان آمار، مدیران و کارشناسان نیز پر کاربرد می‌باشد. ',
      }
    else if (currentRoute === EN_Routes.regionAnalyzePerformance)
      return {
        title: 'گزارش آنالیز کارکرد',
        messageOne: 'این قسمت جهت مشاهده آمار کلیه قرائت های ثبت شده توسط قرائت کننده ها از نظر بیشینه، کمینه، میانه و ... در وضعیت قرائت مشخص می باشد. ',
        messageTwo: 'این قسمت بعلت آمار کلی قرائت های ثبت شده برای متخصصان آمار نیز پرکاربر می‌باشد. ',
      }
    else if (currentRoute === EN_Routes.excelBuilder)
      return {
        title: 'گزارش ساز',
        messageOne: 'جهت ساخت گزارشی که بتوان فایل اکسل آنرا دانلود کرد، پارامتر های مورد نیاز را کامل و ثبت میکنیم. سپس در بخش گزارش ها/ گزارش های Excel به گزارش ساخته شده دسترسی و با مقادیر دلخواه فایل اکسل را دانلود خواهیم کرد.',
      }
    else if (currentRoute === EN_Routes.reportMaster)
      return {
        title: 'بازرسی',
        messageOne: 'این بخش جهت گزارش گیری می باشد. در هر قسمت با وارد کردن مقادیر خواسته شده براساس تاریخ و یا دوره میتوان گزارش ها و گاهی نمودار مناسب آن بخش را مشاهده کرد. \n ✔️	میتوان در تنظیمات کاربری قسمت برنامه، نوع جستجو را تغییر داد تا در بخش های مختلف سامانه طبق آن مقدار جستجو انجام شود. ',
        messageTwo: 'درصورتی که بازرسی صورت گرفته باشد در این قسمت قابل مشاهده است.'
      }
    else if (currentRoute === EN_Routes.reportDetails)
      return {
        title: 'جزئیات بازرسی',
        messageOne: 'این بخش جهت گزارش گیری می باشد. در هر قسمت با وارد کردن مقادیر خواسته شده براساس تاریخ و یا دوره میتوان گزارش ها و گاهی نمودار مناسب آن بخش را مشاهده کرد. \n ✔️	میتوان در تنظیمات کاربری قسمت برنامه، نوع جستجو را تغییر داد تا در بخش های مختلف سامانه طبق آن مقدار جستجو انجام شود. ',
        messageTwo: 'درصورتی که جزئیات بازرسی توسط قرائت کننده ثبت شده باشد در این قسمت قابل مشاهده است. همچنین با کلیک بر روی گزینه آخر(آیکن عکس) میتوان عکس/صوت گرفته شده را بررسی نمود.'
      }
    else if (currentRoute === EN_Routes.reportTraverse)
      return {
        title: 'پیمایش',
        messageOne: 'این بخش جهت گزارش گیری می باشد. در هر قسمت با وارد کردن مقادیر خواسته شده براساس تاریخ و یا دوره میتوان گزارش ها و گاهی نمودار مناسب آن بخش را مشاهده کرد. \n ✔️	میتوان در تنظیمات کاربری قسمت برنامه، نوع جستجو را تغییر داد تا در بخش های مختلف سامانه طبق آن مقدار جستجو انجام شود. ',
        messageTwo: 'درصورتی که پیمایشی صورت گرفته باشد در این قسمت قابل مشاهده است. همچنین با کلیک بر روی گزینه آخر(آیکن عکس) میتوان عکس/صوت گرفته شده را بررسی نمود.'
      }
    else if (currentRoute === EN_Routes.wrrptsmamgis)
      return {
        title: 'گزارش مکانمند',
        imgOne: 'assets/imgs/help/rr/gis.JPG',
        messageOne: 'این بخش جهت گزارش گیری می باشد. در هر قسمت با وارد کردن مقادیر خواسته شده براساس تاریخ و یا دوره میتوان گزارش ها و گاهی نمودار مناسب آن بخش را مشاهده کرد. \n ✔️	میتوان در تنظیمات کاربری قسمت برنامه، نوع جستجو را تغییر داد تا در بخش های مختلف سامانه طبق آن مقدار جستجو انجام شود. ',
        messageTwo: 'این قسمت برای مشاهده گزارش مکانمند بر اساس وضعیت کنتور، غیرمجاز، تغییر آحاد و تغییر کاربری می‌باشد. یعنی امکان مشاهده وضعیت، در ناحیه مدنظر برروی نقشه. درصورت انتخاب وضعیت کنتور، باید یک وضعیت کنتور انتخاب گردد. با فعال بودن خوشه بندی امکان مشاهده درخواست بر اساس تراکم قابل مشاهده است، درغیر اینصورت نقاطی از مکانها را مشاهده خواهید نمود.',
        messageThree: 'درضمن با کلیک برروی نقاط نمایش داده شده روی نقشه، اطلاعات متناسب با هر نقطه را مشاهده خواهید نمود.'
      }
    else if (currentRoute === EN_Routes.reportTraverseDiffrential)
      return {
        title: 'پیمایش تغییرات',
        messageOne: 'این بخش جهت گزارش گیری می باشد. در هر قسمت با وارد کردن مقادیر خواسته شده براساس تاریخ و یا دوره میتوان گزارش ها و گاهی نمودار مناسب آن بخش را مشاهده کرد. \n ✔️	میتوان در تنظیمات کاربری قسمت برنامه، نوع جستجو را تغییر داد تا در بخش های مختلف سامانه طبق آن مقدار جستجو انجام شود. ',
        messageThree: 'ثبت پیمایش تغییرات توسط قرائت کننده در این قسمت قابل مشاهده است. مقدار پیش فرض نوع پیمایش، تغییر کاربری است. دو ستونِ مقدار قدیم و مقدار جدید نمایش دهنده تغییر صورت گرفته است.'
      }
    else if (currentRoute === EN_Routes.preNumberShown)
      return {
        title: 'با رقم قبلی',
        messageOne: 'این بخش جهت گزارش گیری می باشد. در هر قسمت با وارد کردن مقادیر خواسته شده براساس تاریخ و یا دوره میتوان گزارش ها و گاهی نمودار مناسب آن بخش را مشاهده کرد. \n ✔️	میتوان در تنظیمات کاربری قسمت برنامه، نوع جستجو را تغییر داد تا در بخش های مختلف سامانه طبق آن مقدار جستجو انجام شود. ',
        messageTwo: 'قرائت هایی که توسط قرائت کننده با رقم قبلی صورت گرفته باشد، نمایش داده می شوند. امکان مشاهده برروی نقشه، گزارش بازرسی و تصویر نیز وجود دارد.'
      }
    else if (currentRoute === EN_Routes.reportLocked)
      return {
        title: 'قفل شده ها',
        messageOne: 'این بخش جهت گزارش گیری می باشد. در هر قسمت با وارد کردن مقادیر خواسته شده براساس تاریخ و یا دوره میتوان گزارش ها و گاهی نمودار مناسب آن بخش را مشاهده کرد. \n ✔️	میتوان در تنظیمات کاربری قسمت برنامه، نوع جستجو را تغییر داد تا در بخش های مختلف سامانه طبق آن مقدار جستجو انجام شود. ',
        messageTwo: 'تعداد تلاش بیش از حد قرائت کننده در ثبت، موجب قفل شدن اشتراک شده و در این جدول نمایش داده می شود.'

      }
    else if (currentRoute === EN_Routes.wrRptsDynamic)
      return {
        title: 'گزارش های پویا',
        messageOne: 'این بخش جهت گزارش گیری می باشد. در هر قسمت با وارد کردن مقادیر خواسته شده براساس تاریخ و یا دوره میتوان گزارش ها و گاهی نمودار مناسب آن بخش را مشاهده کرد. \n ✔️	میتوان در تنظیمات کاربری قسمت برنامه، نوع جستجو را تغییر داد تا در بخش های مختلف سامانه طبق آن مقدار جستجو انجام شود. ',
        messageTwo: 'امکان ساخت گزارش براساس نیاز شما در برنامه وجود دارد. پس از ایجاد گزارش امکان استفاده مجدد را خواهد داشت. بدین صورت گزارش را طبق سلیقه خود و بدون محدودیت ایجاد نمایید.امکان ویرایش و حذف در گزارش ایجاد شده نیز وجود دارد.'
      }
    else if (currentRoute === EN_Routes.reportInState)
      return {
        title: 'وضعیت کنتور ها',
        messageOne: 'دانلود فایل Excel تمامی وضعیت های کنتور در بازه زمانی مشخص.'
      }
    else if (currentRoute === EN_Routes.wrExcelviewer)
      return {
        title: 'گزارش های Excel',
        messageOne: 'پس از ساخت گزارش مدنظر خود در قسمت ابزار/گزارش ساز، در این قسمت پارامتر های ساخته شده را با مقادیر دلخواه پر کرده و نسبت به دانلود  اقدام می کنیم.'
      }
    else if (currentRoute === EN_Routes.fragment)
      return {
        title: 'نوبتی',
        messageOne: 'اطلاعات کلی نوبتی در این بخش قابل مشاهده است',
        imgOne: 'assets/imgs/help/fragment/nob2.JPG',
        messageTwo: '✔️	با ورود به بخش مدیریت مسیر ها، امکان ایجاد مسیر/ها برای بازه‌/ها اشتراکی وجود دارد. امکان افزودن، ویرایش، مشاهده جزئیات و حذف هر مورد نیز وجود دارد. \n ✔️	ستون تایید شده به معنای تایید تمامی زیر مجموعه ها(موجود در مدیریت مسیرها) در یک مسیر است. درصورتی که مشکلی در ایجاد و ویرایش وجود داشته باشد سیستم بطور خودکار پیامی برای اصلاح موارد لازم نمایش خواهد داد. \n ✔️	نوبتی در صدور لیست کاربرد دارد. بطوری که مقادیر نوبتی در صدورلیست ها قابل مشاهده هستند و طبق نوبتی ایجاد شده، امکان ایجاد لیست بوجود می آید. \n ✔️ میتوان مسیر های موجود در یک نوبتی را ملاحظه نمود. مثلا یک نوبتی ممکن است به 3 مسیر مجزا تقسیم بندی شده باشد \n ✔️	تنها نوبتی های تایید شده در صدور لیست قابل مشاهده هستند',
        imgTwo: 'assets/imgs/help/fragment/autoImport.JPG',
        messageThree: 'با کلیک برروی صدور لیست خودکار، از این پس برنامه بطور خودکار لیست صادر می‌کند. به این منظور تنها نیاز به تنظیم اولیه اطلاعات مطابق شکل وجود دارد.',
      }
    else if (currentRoute === EN_Routes.fragmentDetail)
      return {
        title: 'جزئیات نوبتی',
        messageOne: 'مسیر های موجود در تصویر زیر دقیقا همان مسیر هایی هستند که حین صدورلیست مشاهده می‌شوند. در صورتی که از بخش صدور لیست مسیر اضافه ای وجود دارد باید از این قسمت اقدام به حذف آن نمایید. یا در صورتی که نوبتی مدنظر شما نیاز به تقسیم بندی به تعداد مسیر بیشتری داشته باشد باید مسیر جدید را به آن نوبتی اضافه نمایید',
        imgOne: 'assets/imgs/help/fragment/nobDetails.png',
        messageTwo: '\n ✔️ یک نوبتی به چند مسیر تقسیم می‌گردد. \n ✔️ شروع مسیرها با مقدار «از اشتراک» نوبتی باید مطابق باشد. \n ✔️ پایان مسیرها با مقدار «تا اشتراک» نوبتی باید مطابق باشد. \n ✔️ با هر تعداد تقسیم بندی، اختلاف بین مسیر اولیه تا ثانویه دقیقا یک  باید باشد(اشتراک جاافتاده ای وجود نداشته باشد). \n ✔️ جزئیات یک مسیر صحیح ایجاد شده در تصویر مشخص گردیده است.',
        messageThree: '',
      }
    else if (currentRoute.includes(EN_Routes.wrimpsimafardpg))
      return {
        title: 'سیمافا صدور لیست',
        messageOne: 'این بخش جهت ایجاد مسیر برای قرائت کننده‌ ها درنظر گرفته شده است. به دو طریق تکی و دسته ای میتوان لیست/مسیر ایجاد کرد.',
        messageTwo: 'جهت صدور لیست تکی کافی است پس از انتخاب قرائت کننده و پر کردن موارد دلخواه با کلیک برروی "صدور لیست" نسبت به ایجاد یک مسیر اقدام نمایید.',
        messageThree: '\n ✔️	بعد از صدور، لیست صادر شده به بخش کارتابل/صادر شده انتقال داده میشود. \n ✔️	درصورتی که لیست قبلا صادر شده باشد، امکان ایجاد مجدد آن وجود ندارد. ',
      }
    else if (currentRoute === EN_Routes.wrimpsimafardpgbatch)
      return {
        title: 'سیمافا افزودن لیست دسته‌ای',
        messageOne: 'جهت صدور لیست دسته ای باید برای هر سطر در جدول(هر مسیر/لیست) یک قرائت کننده انتخاب نمایید و سپس برروی صدور لیست کلیک کنید تا لیست صادر شود. \n ✔️	بعد از صدور، لیست صادر شده به بخش کارتابل/صادر شده انتقال داده میشود. \n ✔️	درصورتی که لیست قبلا صادر شده باشد، امکان ایجاد مجدد آن وجود ندارد. ',
      }
    else if (currentRoute === EN_Routes.assessPre)
      return {
        title: 'بازدید',
        messageOne: 'فیلتر های اشتراک هایی که قصد دارید مجددا قرائت شوند (بازدید شوند) را مشخص نمایید. مثلا در صورتی که قصد دارید اشتراک هایی که وضعیت کنتور نبود داشته اند، اشتراک هایی که وضعیت کنتور عادی داشته اند اما مصرف بالا (High) داشته اند یا گزارش بازرسی خاصی برای آنها ثبت شده است را انتخاب و سپس روی دکمه «جستجو» کلیک نمایید.',
        imgOne: 'assets/imgs/help/tracking/assess1.png',
        messageTwo: ' با کلیک روی جستجو جدولی مشابه تصویر زیر نمایش داده خواهد شد. در صورتی که نیاز دارید اشتراک خاصی برای بازدید ارسال نشود، تیک مربوط به آن را بردارید. نام قرائت کننده، درصد علی الحساب، اجباری بودن ثبت عکس توسط مامور قابل انتخاب می باشد.',
        imgTwo: 'assets/imgs/help/tracking/assess2.png',
        messageThree: ' ✔️	تغییر حالت همه اشتراک های انتخاب شده با تیک انتخاب شود، قابل تغییر است. \n ✔️	عکس ندارد تنها اشتراک هایی که بدون تصویر هستند را نمایش می دهد. \n ✔️جهت تکرار بازدید، یک قرائت کننده را انتخاب و اشتراک هایی که باید بازدید شوند انتخاب شوند. روی دکمه «ثبت بازدید» کلیک نمایید. با این کار یک مسیر جدید با یک شماره پیگیری جدید صادر شده که از کارتابل صادر شده قابل رویت خواهد بود. در پایان پیام "لیست صادر شد" نمایش داده می شود.'
      }
    else if (currentRoute === EN_Routes.wrimperr)
      return {
        title: 'خطاها',
        messageOne: 'هشدار به مواردی مثل ده(۱۰) کاراکتره نبودن کد پستی، خالی بودن قطر کنتور و... است که در روند قرائت ایجاد مشکل نمیکنن اما به هر حال بهتر است که رفع شوند. خطاها مواردی هستند که باعث میشن یک اشتراک قرائت نشه مثل، خالی بودن همزمان تاریخ قرائت قبلی و تاریخ نصب. همچنین برای اطلاع از خطاهای صادر شده با استفاده از شماره پیگیری بخش صدورلیست/ خطای صدور را مشاهده نمایید.',
      }
    else if (currentRoute === EN_Routes.wrimpFileExcel)
      return {
        title: 'فایل Excel',
        messageOne: 'میتوان با یک فایل Excel و قراردادن آن در برنامه، لیست صادر نمود. برای اطلاع از مقادیر صحیح فایل اکسل، نمونه فایل را دانلود نمایید و برای تسریع فرایند و اطمینان از اطلاعات وارد شده علاوه بر خواندن راهنمایی که در فایل قابل دانلود قرار گرفته درون همین فایل ویرایش لازم را نیز انجام و اقدام به صدور لیست نمایید. ',
      }
    else if (currentRoute === EN_Routes.wrImportErrByTrackNumber)
      return {
        title: 'خطای صدور',
        messageOne: 'خطاها مواردی هستند که باعث میشن یک اشتراک قرائت نشه مثل، خالی بودن همزمان تاریخ قرائت قبلی و تاریخ نصب . برای اطلاع از خطاهای صادر شده با استفاده از شماره پیگیری(مربوط به یک لیست/مسیر) این قسمت ارائه شده است.',
      }
    else if (currentRoute === EN_Routes.userLoggins)
      return {
        title: 'ورود های کاربران',
        messageOne: 'اطلاعات ورود کابران با جزئیات بیشتر قابل مشاهده است ',
        messageTwo: 'از جمله دفعات ورود،  سیستم‌عامل و نسخه آن، زمان های وارد شده و ..',
      }
    else
      return {
        title: 'راهنمایی',
        messageOne: 'راهنمایی وجود ندارد',
      }
  }
  openDialog = () => {
    const temp = this.utilsService.compositeService.getRouterUrl();
    let currentVal: IHelpWrapper = this.exactRoute(temp);
    if (!currentVal)
      currentVal = this.similarIncludeRoute(temp);

    this.messageToShow.title = currentVal.title;
    this.messageToShow.imgOne = currentVal.imgOne;
    this.messageToShow.imgTwo = currentVal.imgTwo;
    this.messageToShow.messageOne = currentVal.messageOne;
    this.messageToShow.messageTwo = currentVal.messageTwo;
    this.messageToShow.messageThree = currentVal.messageThree;

    this.utilsService.dialog.open(AddNewComponent, {
      data: currentVal
    });
  }

}







































